Autodesk.Revit.DB.PointCloudInstance.GetPoints(Autodesk.Revit.DB.PointClouds.PointCloudFilter,System.Double,System.Int32)
Extracts a collection of points based on a filter.
Remarks:
If there are more points in the cloud passing the filter than the number requested in this function,
the results may not be consistent if the same call is made again.
filter:
The filter to control which points are extracted. The filter should be passed in the coordinates
of the Revit model.
averageDistance:
Desired average distance between "adjacent" cloud points (Revit units of length).
The smaller the averageDistance the larger number of points will be returned up to the numPoints limit.
Specifying this parameter makes actual number of points returned for a given filter independent of the
density of coverage produced by the scanner.
numPoints:
The maximum number of points requested.
Returns:
A collection object containing points that pass the filter, but no more than the maximum number requested.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The number of points read must range from 1 to 1000000.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for averageDistance must be no more than 30000 feet in absolute value.
Since:
2014

Autodesk.Revit.DB.PointCloudInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Transform)
Creates a new instance of a point cloud based on an input point cloud type and transformation.
document:
The document in which the new instance is created
typeId:
The element id of the PointCloudType.
transform:
The transform that defines the placement of the instance in the Revit document coordinate system.
Returns:
The newly created point cloud instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId typeId is not a valid PointCloudType.
-or-
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.PointCloudInstance.ContainsScan(System.String)
Identifies whether the instance contains a scan.
scanName:
Name of the scan.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.PointCloudInstance.GetScanOrigin(System.String)
Returns the origin point of a scan in model coordinates.
scanName:
Name of the scan.
Returns:
Resulting origin point of the scan.
Throws Autodesk.Revit.Exceptions.ArgumentException:
PointCloudInstance does not contain scan scanName.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014